app/controllers/api/user_controller.rb

SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1  [["user_id", 6]]
---
      def transactions
        transaction = Transaction.where(user_id: params[:id])

INSERT INTO "transactions" ("amount", "transaction_type", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["amount", "1000001.0"], ["transaction_type", "deposit"], ["user_id", 6], ["created_at", "2020-10-04 06:39:39.057201"], ["updated_at", "2020-10-04 06:39:39.057201"]]
---
      def create
        transaction = current_user.transactions.new(transaction_params)
          if transaction.save