app/admin/transactions.rb

  form  do |f|
    f.inputs do
      f.input :amount
      f.input :user_id , as: :select , :collection => User.all.map{ |user| [user.name, user.id]}
---
SELECT "users".* FROM "users"