app/controllers/transactions_controller.rb

SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def show
    @transaction = Transaction.find(params[:id])

INSERT INTO "transactions" ("amount", "transaction_type", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["amount", "10000000.0"], ["transaction_type", "deposit"], ["user_id", 6], ["created_at", "2020-10-04 03:46:46.533249"], ["updated_at", "2020-10-04 03:46:46.533249"]]
---
  def create
    @transaction = current_user.transactions.new(transaction_params)
    respond_to do |format|
      if @transaction.save

UPDATE "transactions" SET "transaction_type" = $1, "updated_at" = $2 WHERE "transactions"."id" = $3  [["transaction_type", "deposit"], ["updated_at", "2020-10-04 02:41:57.126347"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @transaction.update(transaction_params)